semestr2/logika/08.03.2021-znaczenie-cd.md

# Table of Contents

1.  [Koncepcje znaczenia](#orgf99b2b6)
        1.  [Chomsky](#org80b9597)
        2.  [Charles Sanders Pierce (1839 - 1914)](#org0e1a8d7)
        3.  [Richard Rorty](#org5b8ee98)
        4.  [Jaques Derrida](#orga99a321)
        5.  [John Herbert (?)](#org5bb0af1)
        6.  [Mitt](#orgd7386bd)



<a id="orgf99b2b6"></a>

# Koncepcje znaczenia


<a id="org80b9597"></a>

### Chomsky

-   postulował, że istnieje nieświadoma, wrodzona wiedza składniowa
-   nie da się inaczej wytłumaczyć ludzkiej zdolnosci do wytwarzania nowych zdań i determinacji ich prawdziwości


<a id="org0e1a8d7"></a>

### Charles Sanders Pierce (1839 - 1914)

-   pragmatysta amerykański, filozof, semiotyk
-   **znak/reprezentamen:** coś co dla kogos zastępuje coś innego pod pewnym względem. znak zastępuje przedmiot(tylko w relacji; dla kogoś lub czegoś)
-   cały znak nie może istnieć bez całego systemu znaków
-   znaki nie są autonimmmiczne, zależa od systemu znaków
-   znak nie jest niezależny od tego, co znaczy
-   nie istnieje poznanie bezpośrednie - wyraża się w znaku i odnosi się do inncyh znaków
-   nie ma prawd oderwanych, pojedynczych
-   poznanie ma charakter niesubiektywny
-   przedmiot, do którego odnoszą się znaki jest rzeczywisty, zewdnętrzny
-   jeżeli myśl da sie przełożyc na zasady działania nie jest autorefleksją; dotyczy czegoś, ma odniesienie przedmiotowe


<a id="org5b8ee98"></a>

### Richard Rorty

-   


<a id="orga99a321"></a>

### Jaques Derrida

-   "Jak okiem sięgnąć tekst"
-   nie ma rzeczywistosci poza rzeczywistością językową (?)


<a id="org5bb0af1"></a>

### John Herbert (?)

-   behawiorysta społeczny


<a id="orgd7386bd"></a>

### Mitt

